Revit 2026 API

# SweepFailures Properties

---

The BuiltInFailuresSweepFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CannotDrawSweep | Can't create sweep. |
|  | ComplexPathWithComplexProfile | Sweep cannot have a path with ellipse or spline segments and a profile with non-straight lines. |
|  | ProfileLoopEmpty | Profile sketch is empty! |
|  | SweepFailed | Proper sweep geometry creation failed. |
|  | SweepFailedError | Proper sweep geometry creation failed. |
|  | WallSweepInconsistent | The model contains corrupt elements. Delete the corrupt elements to proceed or cancel the action without deleting the elements. |

#### Reference

BuiltInFailuresSweepFailures Class

Autodesk.Revit.DB Namespace